#include <iostream>
#include <cassert>

/**
 * Задано N точек на плоскости. Указать (N-1)-звенную несамопересекающуюся замкнутую ломаную,
 * проходящую через все эти точки. Предполагается, что никакие три точки не лежат на одной прямой.
 * Стройте ломаную от точки, имеющей наименьшую координату x. Если таких точек несколько, то используйте точку с наименьшей координатой y. Точки на ломаной расположите в порядке убывания углов лучей от начальной точки до всех остальных точек.
 * Для сортировки точек реализуйте алгоритм сортировки вставками.
 * Формат ввода
 * В первой строке записано единственное число — число точек N. N ≤ 10000.
 * В последующих N строках записаны координаты точек xi, yi. Все координаты целочисленные xi, yi ≤ 100000.
 * Формат вывода
 * Точки в требуемом порядке.
 *
 * Example:
 * Ввод:
 * 4
 * 0 0
 * 1 1
 * 1 0
 * 0 1
 * Вывод:
 * 0 0
 * 0 1
 * 1 1
 * 1 0
 */

int main() {

}